{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_sequences", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 73], "dtype": "float32", "sparse": false, "name": "input_sequences"}, "inbound_nodes": []}, {"name": "bidirectional", "class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, 15, 73], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["input_sequences", 0, 0, {}]]]}, {"name": "dropout_bidirectional_lstm", "class_name": "Dropout", "config": {"name": "dropout_bidirectional_lstm", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"name": "lstm", "class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "batch_input_shape": [null, 15, 73], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_bidirectional_lstm", 0, 0, {}]]]}, {"name": "drop_out_lstm", "class_name": "Dropout", "config": {"name": "drop_out_lstm", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm", 0, 0, {}]]]}, {"name": "first_dense", "class_name": "Dense", "config": {"name": "first_dense", "trainable": true, "units": 1095, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_out_lstm", 0, 0, {}]]]}, {"name": "drop_out_first_dense", "class_name": "Dropout", "config": {"name": "drop_out_first_dense", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["first_dense", 0, 0, {}]]]}, {"name": "second_dense", "class_name": "Dense", "config": {"name": "second_dense", "trainable": true, "units": 365, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_out_first_dense", 0, 0, {}]]]}, {"name": "drop_out_second_dense", "class_name": "Dropout", "config": {"name": "drop_out_second_dense", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["second_dense", 0, 0, {}]]]}, {"name": "last_dense", "class_name": "Dense", "config": {"name": "last_dense", "trainable": true, "units": 73, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_out_second_dense", 0, 0, {}]]]}, {"name": "activation", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["last_dense", 0, 0, {}]]]}], "input_layers": [["input_sequences", 0, 0]], "output_layers": [["activation", 0, 0]]}, "keras_version": "2.1.1", "backend": "tensorflow"}